   // ! Задача 1
    // Напишите функцию приветствия с языками программирования.
    // Аргументом передаем название языка программирования
    // В результате функция должна вывести в консоль "Привет, о прекрасный язык программирования ИмяЗыка"

    // ? Нужно будет использовать метод строки toLowerCase(). Как думаете зачем?

    // НАЧАЛО

//     function text(variable){
//         let value=variable.toLowerCase()
//         console.log(value);
//     }
//     text('Привет, о прекрасный язык программирования Имя языка')
    
    // КОНЕЦ
    

    
    // ! Задача 2
    // Написать 4 функции для калькулятора
    // Функция сложения двух чисел
    // Функция вычитания двух чисел
    // Функция умножения двух чисел
    // Функция деления двух чисел (Обязательно обработать условие деления на ноль :)
    // Результат функций присвоить в переменные и вывести результат в консоль

    // НАЧАЛО
    function Sum(variable1,variable2){
        let sum=variable1+variable2
        console.log(sum);
        }

Sum(123,34)


    // КОНЕЦ

    // ! Задача 3 
    // Написать функцию, которая принимаем целое число N.
    // Функция должна вернуть сумму всех четных чисел от 0 до N
    
    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ

    // ! Задача 4
    // Написать 2 функции
    // Первая находит минимальный элемент из 3 переданных аргументов
    // Вторая находит минимальный элемент из 3 переданных аргументов
    
    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ